cases/simpleDrops/system/VOFSetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      VOFSetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultSpecies
(
);

vaporPhaseName   alpha1;

shapes
(
    DropMMH
    {
        alphaName  alpha2;
        
        shape    ellipsoid;
        
        ellipsoidCoeffs
        {
            center   (0 0 0.01);
            radius   (0.00115 0.00115 0.00115);
        }
        
        delVapor 3e-4;
        U        (0 0 -1.3);
        
        liquidSpecies
        (
        );
        
        vaporSpecies
        (
        );
    }
    
    DropNTO
    {
        alphaName  alpha3;
        
        shape    ellipsoid;
                
        ellipsoidCoeffs
        {
            center   (0 0 0);
            radius   (0.0035 0.0035 0.002);
        }
        
        delVapor 3e-4;
        U        (0 0 0);
        
        liquidSpecies
        (
        );
        
        vaporSpecies
        (
        );
    }

);


// ************************************************************************* //
